---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFieldId.Equals(System.Object)
source: html/de5dab48-0a7f-574c-d704-d205cfdb290f.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - The other object to evaluate.